GopalSaraf/Practicals/PSDL/include/proc/pic18lf44k22.inc
// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 0F3Ch
// bitfield definitions
ANSELE_ANSE0_POSN                        equ 0000h
ANSELE_ANSE0_POSITION                    equ 0000h
ANSELE_ANSE0_SIZE                        equ 0001h
ANSELE_ANSE0_LENGTH                      equ 0001h
ANSELE_ANSE0_MASK                        equ 0001h
ANSELE_ANSE1_POSN                        equ 0001h
ANSELE_ANSE1_POSITION                    equ 0001h
ANSELE_ANSE1_SIZE                        equ 0001h
ANSELE_ANSE1_LENGTH                      equ 0001h
ANSELE_ANSE1_MASK                        equ 0002h
ANSELE_ANSE2_POSN                        equ 0002h
ANSELE_ANSE2_POSITION                    equ 0002h
ANSELE_ANSE2_SIZE                        equ 0001h
ANSELE_ANSE2_LENGTH                      equ 0001h
ANSELE_ANSE2_MASK                        equ 0004h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0F3Dh
// bitfield definitions
PMD2_ADCMD_POSN                          equ 0000h
PMD2_ADCMD_POSITION                      equ 0000h
PMD2_ADCMD_SIZE                          equ 0001h
PMD2_ADCMD_LENGTH                        equ 0001h
PMD2_ADCMD_MASK                          equ 0001h
PMD2_CMP1MD_POSN                         equ 0001h
PMD2_CMP1MD_POSITION                     equ 0001h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0002h
PMD2_CMP2MD_POSN                         equ 0002h
PMD2_CMP2MD_POSITION                     equ 0002h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0004h
PMD2_CTMUMD_POSN                         equ 0003h
PMD2_CTMUMD_POSITION                     equ 0003h
PMD2_CTMUMD_SIZE                         equ 0001h
PMD2_CTMUMD_LENGTH                       equ 0001h
PMD2_CTMUMD_MASK                         equ 0008h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0F3Eh
// bitfield definitions
PMD1_CCP1MD_POSN                         equ 0000h
PMD1_CCP1MD_POSITION                     equ 0000h
PMD1_CCP1MD_SIZE                         equ 0001h
PMD1_CCP1MD_LENGTH                       equ 0001h
PMD1_CCP1MD_MASK                         equ 0001h
PMD1_CCP2MD_POSN                         equ 0001h
PMD1_CCP2MD_POSITION                     equ 0001h
PMD1_CCP2MD_SIZE                         equ 0001h
PMD1_CCP2MD_LENGTH                       equ 0001h
PMD1_CCP2MD_MASK                         equ 0002h
PMD1_CCP3MD_POSN                         equ 0002h
PMD1_CCP3MD_POSITION                     equ 0002h
PMD1_CCP3MD_SIZE                         equ 0001h
PMD1_CCP3MD_LENGTH                       equ 0001h
PMD1_CCP3MD_MASK                         equ 0004h
PMD1_CCP4MD_POSN                         equ 0003h
PMD1_CCP4MD_POSITION                     equ 0003h
PMD1_CCP4MD_SIZE                         equ 0001h
PMD1_CCP4MD_LENGTH                       equ 0001h
PMD1_CCP4MD_MASK                         equ 0008h
PMD1_CCP5MD_POSN                         equ 0004h
PMD1_CCP5MD_POSITION                     equ 0004h
PMD1_CCP5MD_SIZE                         equ 0001h
PMD1_CCP5MD_LENGTH                       equ 0001h
PMD1_CCP5MD_MASK                         equ 0010h
PMD1_MSSP1MD_POSN                        equ 0006h
PMD1_MSSP1MD_POSITION                    equ 0006h
PMD1_MSSP1MD_SIZE                        equ 0001h
PMD1_MSSP1MD_LENGTH                      equ 0001h
PMD1_MSSP1MD_MASK                        equ 0040h
PMD1_MSSP2MD_POSN                        equ 0007h
PMD1_MSSP2MD_POSITION                    equ 0007h
PMD1_MSSP2MD_SIZE                        equ 0001h
PMD1_MSSP2MD_LENGTH                      equ 0001h
PMD1_MSSP2MD_MASK                        equ 0080h
PMD1_EMBMD_POSN                          equ 0000h
PMD1_EMBMD_POSITION                      equ 0000h
PMD1_EMBMD_SIZE                          equ 0001h
PMD1_EMBMD_LENGTH                        equ 0001h
PMD1_EMBMD_MASK                          equ 0001h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0F3Fh
// bitfield definitions
PMD0_TMR1MD_POSN                         equ 0000h
PMD0_TMR1MD_POSITION                     equ 0000h
PMD0_TMR1MD_SIZE                         equ 0001h
PMD0_TMR1MD_LENGTH                       equ 0001h
PMD0_TMR1MD_MASK                         equ 0001h
PMD0_TMR2MD_POSN                         equ 0001h
PMD0_TMR2MD_POSITION                     equ 0001h
PMD0_TMR2MD_SIZE                         equ 0001h
PMD0_TMR2MD_LENGTH                       equ 0001h
PMD0_TMR2MD_MASK                         equ 0002h
PMD0_TMR3MD_POSN                         equ 0002h
PMD0_TMR3MD_POSITION                     equ 0002h
PMD0_TMR3MD_SIZE                         equ 0001h
PMD0_TMR3MD_LENGTH                       equ 0001h
PMD0_TMR3MD_MASK                         equ 0004h
PMD0_TMR4MD_POSN                         equ 0003h
PMD0_TMR4MD_POSITION                     equ 0003h
PMD0_TMR4MD_SIZE                         equ 0001h
PMD0_TMR4MD_LENGTH                       equ 0001h
PMD0_TMR4MD_MASK                         equ 0008h
PMD0_TMR5MD_POSN                         equ 0004h
PMD0_TMR5MD_POSITION                     equ 0004h
PMD0_TMR5MD_SIZE                         equ 0001h
PMD0_TMR5MD_LENGTH                       equ 0001h
PMD0_TMR5MD_MASK                         equ 0010h
PMD0_TMR6MD_POSN                         equ 0005h
PMD0_TMR6MD_POSITION                     equ 0005h
PMD0_TMR6MD_SIZE                         equ 0001h
PMD0_TMR6MD_LENGTH                       equ 0001h
PMD0_TMR6MD_MASK                         equ 0020h
PMD0_UART1MD_POSN                        equ 0006h
PMD0_UART1MD_POSITION                    equ 0006h
PMD0_UART1MD_SIZE                        equ 0001h
PMD0_UART1MD_LENGTH                      equ 0001h
PMD0_UART1MD_MASK                        equ 0040h
PMD0_UART2MD_POSN                        equ 0007h
PMD0_UART2MD_POSITION                    equ 0007h
PMD0_UART2MD_SIZE                        equ 0001h
PMD0_UART2MD_LENGTH                      equ 0001h
PMD0_UART2MD_MASK                        equ 0080h
PMD0_SPI1MD_POSN                         equ 0001h
PMD0_SPI1MD_POSITION                     equ 0001h
PMD0_SPI1MD_SIZE                         equ 0001h
PMD0_SPI1MD_LENGTH                       equ 0001h
PMD0_SPI1MD_MASK                         equ 0002h
PMD0_SPI2MD_POSN                         equ 0002h
PMD0_SPI2MD_POSITION                     equ 0002h
PMD0_SPI2MD_SIZE                         equ 0001h
PMD0_SPI2MD_LENGTH                       equ 0001h
PMD0_SPI2MD_MASK                         equ 0004h

